run/nonOrthog/sphericalSpreadingTest/resCtrlNonOrthog/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

rm -rf 0 && cp -r 0.org 0 
rm -rf 0/*.template
#rm -rf constant/*.template
#rm -rf system/*.template

runApplication tetMesh #cartesianMesh

# Initialization
runApplication surfaceInitVolumeFraction

# Postprocessing
#runApplication foamToVTK

runApplication decomposePar

#mpirun -n 8 interFlow -parallel > log.interFlow

##some commands
#List all parametric variations
#pyFoamRunParameterVariation.py --list-variations case case.parameter
#Create parametric study
#./create-study.py -s test -c case -p case.parameter
#For visualization of PLICs VTKs
#foamSequenceVTKFiles -vtk
# ----------------------------------------------------------------- end-of-file
